Repository: ashaffir/bingo
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es, he

source: There are no public albums waiting for approval
es: No hay álbumes públicos en espera de aprobación.
he: איו אלבומים ציבוריים שמחכים לאישור

source: Change Language
es: Cambiar idioma
he: שנה שפה

source: Instructions
es: Instrucciones
he: הוראות הפעלה

source: Home
es: Página principal
he: בית

source: About Us
es: Sobre nosotras
he: אודות

source: Contact Us
es: Contacta con nosotras
he: צור קשר

source: Terms & Conditions
es: Términos y condiciones
he: תנאי שימוש

source: Privacy
es: Intimidad
he: פרטיות

source: You Host
es: Crear y alojar
he: הפוך למנחה

source: a Photo Bingo
es: un bingo de fotos
he: בינגו תמונות

source: Customize bingo games using your own photos
es: Personaliza los juegos de bingo con tus propias fotos
he: התאם אישית משחקי בינגו באמצעות התמונות משלך

source: Become Host
es: Ser un Anfitrión
he: הפוך למנחה

source: Login
es: el Login
he: הכנס

source: Play
es: Jugar
he: שחק

source: How it
es: Cómo
he: איך זה

source: Works
es: funciona
he: עובד

source: Read More
es: Lee mas
he: קרא עוד

source: Ticket Pricing
es: Precio de las entradas
he: מחירי כרטיסים

source: Family
es: Familia
he: משפחה

source: Up to
es: Arriba a
he: עד

source: players per game and
es: Jugadores por juego y
he: שחקנים למשחק ו

source: host
es: anfitrión
he: מנחה

source: Join
es: Unirse
he: הצטרף

source: Family, Friends, Team
es: Familia, amigos, equipo
he: משפחה, חברים, צוות

source: For any additional player above
es: Para cualquier jugador adicional arriba
he: לכל שחקן נוסף מעל

source: Fund your account
es: Financie su cuenta
he: ממן את החשבון שלך

source: Subcribe to our Newsletter
es: Suscríbete a nuestro boletín
he: הירשם לניוזלטר שלנו

source: Enter email address
es: Introduzca la dirección de correo electrónico
he: הזן כתובת דואל

source: Page not found
es: Página no encontrada
he: הדף לא נמצא

source: Polybingo-About Us
es: Sobre nosotras
he: אודות

source: About
es: Sobre
he: אודותינו

source: Dashboard
es: Tablero
he: לוח מחוונים

source: Profile
es: Perfil
he: פרופיל

source: Logout
es: Cerrar sesión
he: התנתק

source: Public Albums
es: Álbumes públicos
he: אלבומים ציבוריים

source: Create a Bingo Album
es: Crear un álbum de bingo
he: צור אלבום בינגו

source: My Albums
es: Mis álbumes
he: האלבומים שלי

source: Search Albums
es: Buscar álbumes
he: חפש אלבומים

source: Follow us
es: Síganos
he: Síganos

source: Join Our Newsletter
es: Suscríbete a nuestro boletín
he: הירשם לניוזלטר שלנו

source: Polybingo-Player Bingo Card
es: Polybingo - Tarjeta de bingo para jugadores
he: פוליבינגו - כרטיס בינגו לשחקן

source: Game ID
es: ID del juego
he: מזהה משחק

source: Waiting for host approval. Hold on
es: Esperando la aprobación del anfitrión. Espere
he: ממתין לאישור המארח. אנא המתן

source: Game starting soon. Just a second
es: El juego comenzará pronto. Sólo un segundo
he: המשחק יתחיל בקרוב. רק שניה

source: Game Over. Thank you for playing
es: Juego terminado. Gracias por jugar
he: סוף המשחק. תודה ששיחקת

source: Ticket Number
es: Numero de ticket
he: כרטיס מספר

source: Win Condition
es: Condición de victoria
he: תנאי לנצח

source: Current Image
es: Imagen actual
he: תמונה נוכחית

source: Bingo!
he: !בינגו

source: Match
es: Partido
he: יש

source: PolyBingo-Check Bingo Card - Result
es: PolyBingo - Check Bingo Card - Resultado
he: PolyBingo - בדוק כרטיס בינגו - תוצאה

source: Please rotate your device to continue
es: Gire su dispositivo para continuar
he: סובב את המכשיר שלך כדי להמשיך

source: Shown Pictures
es: Imágenes mostradas
he: תמונות מוצגות

source: Player
es: Jugador
he: שחקן

source: card
es: tarjeta
he: כרטיס

source: Congratulations
es: Felicidades
he: מזל טוב

source: Card Number
es: Número de tarjeta
he: מספר כרטיס

source: WON
es: ganaste
he: זכית ב

source: Not yet
es: Aún no
he: עדיין לא

source: Check another
es: Mira otro
he: בדוק נוסף

source: Continue
es: Seguir
he: המשך

source: PolyBingo - Check Bingo Card
es: PolyBingo - Compruebe la tarjeta de bingo
he: PolyBingo - בדוק כרטיס בינגו

source: Check Bingo
es: Ver bingo
he: בדוק בינגו

source: PolyBingo - Bingo Game Show
es: PolyBingo - Programa de juegos de bingo
he: PolyBingo - מופע משחקי בינגו

source: Out
es: Afuera
he: הוצגו

source: Next
es: Próxima
he: הבא

source: Check
es: Comprobar
he: בדוק

source: Bingo
he: בינגו

source: PolyBingo-Game Over
es: Juego terminado
he: סוף המשחק

source: Prize Name
es: Nombre del premio
he: שם הפרס

source: Game Over
es: Juego terminado
he: סוף המשחק

source: Thank you for playing
es: Gracias por jugar
he: תודה ששיחקתם

source: Close
es: Cerca
he: סגור

source: Polybingo-Bingo Game Start
es: Polybingo - Inicio del juego de bingo
he: Polybingo - תחילת משחק הבינגו

source: Copy game details
es: Copiar detalles del juego
he: העתק את פרטי המשחק

source: Tickets
es: Entradas
he: כרטיסים

source: out of available
es: fuera de disponible
he: מתוך

source: Start Bingo
es: Iniciar bingo
he: התחל בינגו

source: Price
es: Precio
he: מחיר

source: Current Players
es: Jugadores actuales
he: רשימת שחקנים

source: Game details copied! Do a CTRL - V to paste
he: פרטי המשחק הועתקו! בצע CTRL - V כדי להדביק

source: Polybingo-Contact Us
es: Polybingo-Contáctenos
he: פוליבינגו-צור קשר

source: Send us an email
es: Enviar mensaje
he: שלח מייל

source: Send us a message
es: Enviar mensaje
he: שלח הודעה

source: Your Name
es: Tu nombre
he: השם שלך

source: Please enter at least 4 chars
es: Ingrese al menos 4 caracteres
he: אנא הכנס לפחות 4 תווים

source: Your Email
es: Tu email
he: האימייל שלך

source: Please enter a valid email
es: Por favor introduzca una dirección de correo electrónico válida
he: אנא הכנס דואל חוקי

source: Subject
es: Sujeto
he: נושא

source: Please enter at least 8 chars of subject
es: Ingrese al menos 8 caracteres de asunto
he: אנא הזן לפחות 8 תווים של הנושא

source: Please write something for us
es: Por favor escribe algo para nosotros
he: כתוב לנו משהו

source: Message
es: Mensaje
he: הודעה

source: Send Message
es: Enviar mensaje
he: שלח הודעה

source: Polybingo-Add Funds
es: Polybingo - Agregar fondos
he: פוליבינגו - הפקדה

source: Deposit Funds
es: Fondos de depósito
he: הפקדת כספים

source: How much money would you like to add to your account
es: Cuánto dinero le gustaría agregar a su cuenta
he: כמה כסף תרצה להוסיף לחשבונך

source: Choose an amount
es: Elige una cantidad
he: בחר סכום

source: Other
es: Otra
he: אחר

source: Enter a custom amount
es: Ingrese una cantidad personalizada
he: הזן סכום

source: The amount shoud be between
es: La cantidad debe estar entre
he: הסכום צריך להיות בין

source: and
es: y
he: ו- $

source: Coupon
es: Cupón
he: קופון

source: Make Payment
es: Hacer el pago
he: שלם

source: Album name
es: Nombre del álbum
he: שם האלבום

source: Description
es: Descripción
he: תיאור

source: Category
es: Categoría
he: קטגוריה

source: make game
es: hacer juego
he: צור משחק

source: Album not found
es: Álbum no encontrado
he: האלבום לא נמצא

source: Polybingo-Create a Bingo Album
es: Crear un álbum de bingo
he: צור אלבום בינגו

source: Card sizes
es: Tamaños de tarjeta
he: גודל כרטיסים

source: images uploaded
es: imágenes cargadas
he: תמונות שהועלו

source: Upload images
es: Subir imagenes
he: להעלות תמונות

source: Uploaded
es: Subido
he: הועלו

source: Upload or drop images here
es: Sube o suelta imágenes aquí
he: העלה או גרור ושחרר תמונות לכאן

source: Edit images
es: Editar imagenes
he: ערוך תמונות

source: Where should it be saved
es: ¿Dónde debería guardarse?
he: איפה צריך לשמור אותו

source: Only you can use the album
he: רק אתה יכול להשתמש באלבום

source: Make your album publicly used and visible to all hosts
es: Haz que tu álbum sea de uso público y visible para todos los anfitriones.
he: הפוך את האלבום שלך לשימוש ציבורי וגלוי לכל המארחים

source: Name
es: Nombre
he: שם

source: Select Album Category
es: Seleccionar categoría de álbum
he: בחר קטגוריה לאלבום

source: Save
es: Ahorrar
he: שמור

source: Polybingo team will review all images before publishing. Please make sure you have permission to use these images.
es: El equipo de Polybingo revisará todas las imágenes antes de publicarlas. Por favor asegúresetienes permiso para usar estas imágenes.
he: צוות פוליבינגו יבדוק את כל התמונות לפני הפרסום. בבקשה תוודאייש לך הרשאה להשתמש בתמונות אלה

source: Enter name
es: Ingrese su nombre
he: הכנס שם

source: Please enter a name to the album
es: Ingresa un nombre para el álbum.
he: אנא הזן שם לאלבום

source: Please select a category for the album
es: Selecciona una categoría para el álbum.
he: אנא בחר קטגוריה לאלבום

source: Polybingo-Dashboard Main
es: Polybingo - Tablero principal
he: Polybingo - לוח המחוונים הראשי

source: There are no public albums here
es: No hay álbumes públicos aquí
he: אין כאן אלבומים ציבוריים

source: Polybingo-Instructions
es: Instrucciones
he: הוראות הפעלה

source: Create Album
es: Crear albúm
he: צור אלבום

source: Create a Game
es: Crea un juego
he: צור משחק

source: Setup a Game
es: Configurar un juego
he: הגדר משחק

source: Broadcast/Share the Game
es: Transmite el juego
he: שדר את המשחק

source: Run the Game
es: Ejecutar el juego
he: הפעל את המשחק

source: Polybingo-My Bingo Albums
es: Polybingo - Mis álbumes de bingo
he: פוליבינגו - אלבומי הבינגו שלי

source: Delete this Album
es: Eliminar este álbum
he: מחק אלבום

source: Edit this Album
es: Editar este álbum
he: ערוך אלבום

source: You have not created any albums yet
es: Aún no has creado ningún álbum
he: עדיין לא יצרת אף אלבום

source: Create an Album
es: Crear un álbum
he: צור אלבום

source: Album deleted cannot be restored. Please confirm delete
es: El álbum eliminado no se puede restaurar. Confirma eliminar
he: לא ניתן לשחזר את האלבום שנמחק. אנא אשר מחיקה

source: Confirm
es: Constatar
he: אשר סיסמה

source: Search Results
es: Resultados de la búsqueda
he: תוצאות חיפוש

source: View Album
es: Ver álbum
he: צפייה באלבום

source: Nothing found to match your search
es: No se encontró nada que coincida con su búsqueda
he: שום דבר לא נמצא התואם את החיפוש שלך

source: Polybingo-Start a Bingo Game
es: Polybingo - Inicie un juego de bingo
he: Polybingo - התחל משחק בינגו

source: How many prizes are you offering
es: Cuantos premios estás ofreciendo
he: כמה פרסים אתה מציע

source: 1 Prize
es: 1 premio
he: פרס אחד

source: 2 Prizes
es: 2 premios
he: שני פרסים

source: 3 Prizes
es: 3 premios
he: שלשה פרסים

source: Prize #1
es: Premio # 1
he: פרס 1

source: Prize name
es: Nombre del premio
he: שם הפרס

source: Upload or drop prize image here
es: Sube o suelta la imagen del premio aquí
he: העלה את תמונת הפרס לכאן

source: Auto Join
es: Unión automática
he: הצטרפות אוטומטית

source: Anyone with the game ID will be able to join automatically
es: Cualquiera que tenga el ID del juego podrá unirse automáticamente
he: כל מי שיש לו מזהה משחק יוכל להצטרף אוטומטית

source: Join by Request
es: Únase por solicitud
he: הצטרף לפי בקשה

source: You will need to approve every player that will enter the game ID before the game starts
es: Deberá aprobar a todos los jugadores que ingresen el ID del juego antes de comienza el juego
he: יהיה עליך לאשר כל שחקן שיכניס את מזהה המשחק לפני תחילת המשחק

source: Auto Mark
es: Marca automática
he: סימון אוטומטי

source: The system marks the player board with drawn images automatically
es: El sistema marca el tablero del jugador con imágenes dibujadas automáticamente
he: המערכת מסמנת אוטומטית את התמונות שיוצאות על הכרטיס

source: Start the game
es: Empieza el juego
he: תתחיל את המשחק

source: Cancel
es: Cancelar
he: ביטול

source: Prize
es: Premio
he: פרס

source: Any Line
es: Cualquier línea
he: כל שורה

source: Any two Lines
es: Dos líneas cualesquiera
he: כל שתי שורות

source: You are missing a prize image or prize title. Please upload an image and give it a title
es: Falta una imagen de premio o un título de premio. Sube una imagen ydarle un título
he: חסר לך תמונת פרס או כותרת פרס. אנא העלה תמונה ותן לה כותרת

source: Polybingo-Create Photo-Bingo Games
es: Polybingo - Crea juegos de Photo-Bingo
he: Polybingo - צור משחקי פוטו-בינגו

source: Create & Host
es: Crear y alojar
he: צור ותנחה

source: Go to Dashbaord
es: Ir al panel de control
he: לוח מחוונים

source: Players click here
es: Los jugadores hacen clic aquí
he: שחקנים, לחצו כאן

source: Why use Polybingo
es: Por que usar Polybingo
he: מדוע להשתמש בפוליבינגו

source: Hosts
es: Hospedadores
he: מארחים

source: Games
es: משחקים
he: משחקים

source: Albums
es: Álbumes
he: אלבומים

source: Players
es: Jugadores
he: שחקנים

source: Choose Your Bingo Plan
es: Elija su plan de bingo
he: בחר את תוכנית הבינגו שלך

source: players per game
es: Jugadores por juego
he: שחקנים למשחק

source: Downgrade
es: Degradar
he: בטל רישום

source: Current Plan
es: Plan actual
he: התוכנית הנוכחית

source: Upgrade
es: Potenciar
he: שדרג

source: Buy Now
es: Compra ahora
he: קנה

source: Professional organizer?
es: Organizador profesional?
he: מארגן מקצועי?

source: Need more players?
es: ¿Necesitas más jugadores?
he: זקוק לעוד שחקנים?

source: Ticket
es: Boleto
he: כרטיס

source: Not ready to buy?
es: ¿No estás listo para comprar?
he: לא מוכן לקנות?

source: Try it out first and host Bingo with up to
es: Pruébelo primero y organice Bingo con hasta
he: נסה זאת תחילה וארח בינגו עד

source: players. You can upgrade at any time.
es: jugadores. Puede actualizar en cualquier momento.
he: שחקנים. אתה יכול לשדרג בכל עת.

source: Sign up for free - no credit card required
es: Regístrese gratis, no se requiere tarjeta de crédito
he: הירשם בחינם - אין צורך בכרטיס אשראי

source: Login with
es: Iniciar con
he: התחבר עם

source: Email
he: אימייל

source: Password
es: Contraseña
he: סיסמה

source: Do not have an account
es: No tiene una cuenta
he: אין לך חשבון

source: Register
es: Registrarse
he: הירשם

source: here
es: aquí
he: כאן

source: Forgot your password
es: Olvidaste tu contraseña
he: שכחת ססמה

source: Menu
es: Menú
he: תפריט

source: Customize your bingo game
es: Personaliza tu juego de bingo
he: התאם אישית את משחק הבינגו שלך

source: Add funds to your account
es: Agrega fondos a tu cuenta
he: הוסף כספים לחשבונך

source: Your account balance
es: El saldo de su cuenta
he: יתרת החשבון שלך

source: Add your logo
es: Agrega tu logo
he: הוסף את הלוגו שלך

source: Company Name
es: Nombre de empresa
he: שם החברה

source: VAT Number
es: Número de valor agregado
he: מספר מעמ

source: Update Details
es: Detalles de actualización
he: עדכן פרטים

source: Any One Line
es: Cualquier línea
he: שורה

source: Two Lines
es: Dos lineas
he: שתי שורות

source: Polybingo-Player Access Page
es: Polybingo - Página de acceso del jugador
he: פוליבינגו - דף גישה לשחקן

source: Game Code
es: Código de juego
he: מספר משחק

source: Terms
es: Condiciones
he: תנאי שימוש

source: Polybingo-Privacy
es: Polybingo - Privacidad
he: פוליבינגו - פרטיות

source: You are logged in
es: Estás conectado
he: אתה כבר מחובר

source: Go to Dashboard
es: Ir al panel de control
he: לוח מחוונים

source: Register an existing account
es: Registra una cuenta existente
he: הירשם עם חשבון קיים

source: Register with your email
es: Regístrese con su correo electrónico
he: הירשם באמצעות הדואל שלך

source: Confirm Password
es: Confirmar contraseña
he: אשר סיסמה

source: Country
es: País
he: מדינה

source: Choose your country
es: Elige tu país
he: בחר את מדינתך

source: I wish to receive information, offers, recommendations, and updates from
es: Deseo recibir información, ofertas, recomendaciones y actualizaciones de
he: אני רוצה לקבל מידע, הצעות, המלצות ועדכונים מאת

source: Already have an account
es: Ya tienes una cuenta
he: כבר יש לך חשבון

source: By signing up, you accept our
es: Al registrarse, acepta nuestro
he: בהרשמה אתה מקבל את

source: Terms and Conditions
es: Términos y Condiciones
he: תנאי השימוש

source: Please read our
es: Por favor lea nuestro
he: אנא קרא את

source: Privacy Policy
es: Política de privacidad
he: מדיניות פרטיות שלנו

source: Polybingo-Terms & Conditions
es: Términos y condiciones
he: תנאי שימוש

source: Sorry, the requested album was not found
es: Lo sentimos, no se encontró el álbum solicitado.
he: מצטערים, האלבום המבוקש לא נמצא

source: Welcome to Polybingo
es: Bienvenido a polybingo
he: ברוך הבא לפוליבינגו

source: Oops, your message was not sent. Please try again later
es: Vaya, su mensaje no fue enviado. Por favor, inténtelo de nuevo más tarde
he: אופס, ההודעה שלך לא נשלחה. בבקשה נסה שוב מאוחר יותר

source: Your message was sent. We will be in touch soon
es: Tu mensaje fue enviado. Nos veremos pronto
he: ההודעה שלך נשלחה. נהיה בקשר בקרוב

source: Album created successfuly
es: Álbum creado correctamente
he: האלבום נוצר בהצלחה

source: Your Bingo Album was updated
es: Tu álbum de bingo fue actualizado
he: אלבום הבינגו שלך עודכן

source: Album deleted
es: Álbum eliminado
he: האלבום נמחק

source: Failed deleting the album. Please try again later
es: No se pudo borrar el álbum. Por favor, inténtelo de nuevo más tarde
he: שגיאה במחיקת האלבום. בבקשה נסה שוב מאוחר יותר

source: There was an error uploading the images prizes. Please try reducing the images sizes.
es: Se produjo un error al cargar los premios de las imágenes. Intente reducir el tamaños de imágenes.
he: אירעה שגיאה בהעלאת פרסי התמונות. אנא נסה להקטין אתגדלי תמונות.

source: Game already played
es: Juego ya jugado
he: המשחק הסתיים

source: Please enter a valid card number
es: Por favor, introduzca un número de tarjeta válido
he: נא להזין מספר כרטיס תקף

source: The ticket is not a part of this game
es: El boleto no es parte de este juego.
he: הכרטיס אינו חלק מהמשחק הזה

source: You have already used this coupon. Please try another or use of the of the deposit options
es: Ya usaste este cupón. Pruebe con otro o utilice el de opciones de depósito
he: כבר השתמשת בקופון הזה. אנא נסה אחר או השתמש באחת מאפשרויות ההפקדה האחרות

source: The amount entered is not valid. Please make sure the deposit is above $
es: La cantidad ingresada no es válida. Asegúrese de que el depósito sea superior a $
he: הסכום שהוזן אינו תקף. אנא ודא כי ההפקדה היא מעל $

source: and below $
es: y por debajo de $
he: ונמוך מ- $

source: Please enter a valid amount
es: Por favor introduzca una dirección de correo electrónico válida
he: אנא הכנס ערך חוקי

source: Please enter an amount, or pick one of the predefined amounts.
es: Ingrese una cantidad o elija una de las cantidades predefinidas.
he: אנא הזן סכום, או בחר את אחד מהסכומים שהוגדרו מראש.

source: Deposit
es: Depositar
he: להפקיד

source: Options to make the deposit:
es: Opciones para realizar el depósito:
he: אפשרויות לבצע את ההפקדה

source: Paypal
he: פייפל

source: Error processing the payment. Please try again later
es: Error al procesar el pago. Por favor, inténtelo de nuevo más tarde
he: שגיאה בעיבוד התשלום. בבקשה נסה שוב מאוחר יותר

source: Thank you
es: Gracias
he: תודה

source: Hi
es: Hola
he: היי

source: This email was sent to
es: Este correo electrónico fue enviado a
he: דואל זה נשלח אל

source: You received this email because you created a Polybingo account
es: Recibió este correo electrónico porque creó una cuenta de Polybingo
he: קיבלת דואל זה מכיוון שיצרת חשבון Polybingo

source: Unsubscribe
es: Darse de baja
he: בטל את הרישום

source: You are unsubscribed
es: Estás cancelado
he: הרישום שלך בוטל

source: Unsubscribed by mistake / Re-subscribe
es: No suscrito por error / re-suscribirse
he: ביטלת את הרישום בטעות / הירשם כמנוי מחדש

source: Summary
es: Resumen
he: סיכום

source: Amount Selected
es: Cantidad seleccionada
he: הסכום שנבחר

source: Insert the coupon and click on the Check button to validate
es: Inserte el cupón y haga clic en el botón Verificar para validar
he: הכניסו את הקופון ולחצו על כפתור ה- Check לאימות

source: Apply
es: Aplicar
he: יישם

source: Discount
es: Descuento
he: הנחה

source: Bill Amount
es: Total de la factura
he: סכום

source: Choose payment option
es: Elija la opción de pago
he: בחר באפשרות תשלום

source: Credit Card
es: Tarjeta de crédito
he: כרטיס אשראי

source: Card Owner
es: Titular
he: בעל הכרטיס

source: Card Owner Name
es: Nombre del propietario de la tarjeta
he: שם בעל הכרטיס

source: Card number
es: Número de tarjeta
he: מספר כרטיס

source: Valid card number
es: Número de tarjeta válido
he: מספר כרטיס תקף

source: Expiration Date
es: Fecha de caducidad
he: תאריך תפוגה

source: Three digit CV code on the back of your card
he: קוד CVV תלת ספרתי בגב הכרטיס שלך

source: Confirm Payment
es: Confirmar pago
he: אשר תשלום

source: Log into my Paypal
es: Iniciar sesión en mi Paypal
he: היכנס ל- Paypal

source: Note: After clicking on the button, you will be directed to a secure gateway for payment. After completing the payment process, you will be redirected back to the website.
es: Nota: Después de hacer clic en el botón, se le dirigirá a una pasarela segura para el pago. Después de completar el proceso de pago, será redirigido al sitio web.
he: הערה: לאחר לחיצה על הכפתור, תועבר לשער מאובטח לתשלום. לאחר השלמת תהליך התשלום, תנותב בחזרה לאתר.

source: Options to make the deposit
es: Opciones para realizar el depósito
he: אפשרויות לבצע את ההפקדה

source: Polybingo-Payment
es: Polybingo - Pago
he: פוליבינגו - תשלום

source: Total payment amount
es: Importe total del pago
he: סכום תשלום כולל

source: Credit or debit card
es: Tarjeta de crédito o débito
he: כרטיס אשראי

source: Submit Payment
es: Enviar pago
he: אשר תשלום

source: Polybingo-Subscribe
es: Polybingo-Suscríbete
he: פוליבינגו - הרשם

source: Subscribe to plan
es: Suscribir
he: הירשם כמנוי

source: Plan
es: suscripción
he: מנוי

source: Billed monthly
es: facturación mensual
he: חיוב חודשי

source: Billed annualy
es: facturación anual
he: חיוב שנתי

source: Subtotal
es: Total parcial
he: סך הכל

source: Insert the coupon and click on the Apply button to validate
es: Inserte el cupón y haga clic en el botón Aplicar para validar
he: הכנס את הקופון ולחץ על כפתור יישם כדי לאמת

source: Total due today
es: Total vencido hoy
he: סך המגיע היום

source: Billing Information
es: Datos de facturación
he: פרטי חיוב

source: Safe, secure, encrypted payment
es: Pago seguro, seguro y encriptado
he: תשלום בטוח, מאובטח, מוצפן

source: Your account was sucessfully credited with $
es: Su cuenta fue acreditada con éxito con $
he: חשבונך זוכה בהצלחה ב- $

source: Something went wrong with your payment. Your account balance was not updated.
es: Algo salió mal con su pago. El saldo de su cuenta no se actualizó.
he: משהו השתבש בתשלום שלך. יתרת חשבונך לא עודכנה.

source: New Invoice From Polybingo - PI0000
es: Nueva factura de Polybingo - PI0000
he: חשבונית חדשה מפוליבינגו - PI0000

source: Thank you for the payment. You should see your updated balance shortly.
es: Gracias por el pago. Debería ver su saldo actualizado en breve.
he: תודה על התשלום. אתה אמור לראות את היתרה המעודכנת שלך בקרוב.

source: Payment successfuly completed. Thank you.
es: Pago completado con éxito. Gracias.
he: התשלום הושלם בהצלחה. תודה.

source: Failed to complete the payment. Please contact Polybingo support
es: No se pudo completar el pago. Póngase en contacto con el soporte de Polybingo
he: השלמת התשלום נכשלה. אנא צרו קשר עם התמיכה של Polybingo

source: Your payment was canceled. Your account balance was not updated.
es: Tu pago fue cancelado. El saldo de su cuenta no se actualizó.
he: התשלום שלך בוטל. יתרת חשבונך לא עודכנה.

source: No such coupon
es: No hay tal cupón
he: אין קופון כזה

source: Something is broken. Please try again later.
es: Algo salió mal. Por favor, inténtelo de nuevo más tarde.
he: משהו השתבש. בבקשה נסה שוב מאוחר יותר.

source: Payment done successfully. Thank you
es: Pago realizado correctamente. Gracias
he: התשלום בוצע בהצלחה. תודה

source: Something went wrong. Please contact Polybingo support
es: Algo salió mal. Por favor, inténtelo de nuevo más tarde.
he: משהו השתבש. בבקשה נסה שוב מאוחר יותר.
