Repository: ashaffir/bingo
Catalog: locale/*/LC_MESSAGES/django.po
Languages: es, he

source: There was a problem processing your request. Please contact Polybingo support
es: Hubo un problema al procesar su solicitud. Póngase en contacto con el soporte de Polybingo
he: הייתה בעיה בעיבוד בקשתך. אנא צרו קשר עם התמיכה של Polybingo

source: Unable to log in?
es: ¿Incapaz de iniciar sesión?
he: לא מצליח להתחבר?

source: We will send a recovery link to
es: Enviaremos un enlace de recuperación a
he: אנו נשלח קישור שחזור אל

source: Reset!
es: ¡Reiniciar!
he: אתחול!

source: Remembered?
es: ¿Recordado?
he: נזכרת?

source: Change password
es: Cambia la contraseña
he: שנה סיסמא

source: Old password
es: Contraseña anterior
he: סיסמה ישנה

source: New password
es: Nueva contraseña
he: סיסמה חדשה

source: Confirm password
es: Confirmar contraseña
he: אשר סיסמה

source: Change
es: Cambio
he: שנה

source: Your password was changed
es: Tu contraseña fue cambiada
he: הסיסמה שלך שונתה בהצלחה

source: Your password has been reset. You may go ahead and
es: Tu contraseña ha sido cambiada. Puedes seguir adelante y
he: סיסמתך שונתה. אתה יכול להמשיך ו

source: login
es: el Login
he: להכנס

source: Polybingo-Profile Page
es: Página de perfil de Polybingo
he: עמוד פרופיל

source: User Profile
es: Perfil
he: פרופיל משתמש

source: Upload your profile or a company photo
es: Sube tu perfil o una foto de empresa
he: העלה את הפרופיל שלך או תמונת חברה

source: Company Website
es: Página Web de la compañía
he: אתר החברה

source: Activity
es: Actividad
he: פעילות

source: Personal
he: אישי

source: Subscription
es: Descripción
he: תיאור

source: First name
es: Nombre de pila
he: הכנס שם

source: Last name
es: Apellido
he: הכנס שם משפחה

source: Phone
es: Teléfono
he: טלפון

source: enter phone
es: Ingrese teléfono
he: הכנס טלפון

source: Mobile
es: número de celular
he: נייד

source: enter mobile number
es: ingrese el número de celular
he: הזן מספר נייד

source: enter your mobile number if any
es: ingrese su número de celular si lo tiene
he: הזן את מספר הנייד שלך אם יש

source: enter company name
es: Nombre de empresa
he: שם החברה

source: enter your company name if any
es: Nombre de empresa
he: שם החברה

source: enter your company VAT number
es: introduzca el número de IVA de su empresa
he: הזן את מספר המעמ של החברה שלך

source: Current Subscription Plan
es: Plan de suscripción actual
he: מנוי נוכחי

source: up to
es: Arriba a
he: עד

source: players
es: jugadores
he: שחקנים

source: Downgrade to Free
es: cancelar suscripción
he: בטל מנוי

source: Good for family gatherings
es: Bueno para reuniones familiares
he: טוב למפגשים משפחתיים

source: Change to Free
es: cancelar suscripción
he: בטל מנוי

source: Cancel Subscription
es: cancelar suscripción
he: בטל מנוי

source: Upgrade to Basic plan
es: Actualizar al plan básico
he: שדרג לתכנית בסיסית

source: Change to Basic plan
es: Actualizar al plan básico
he: שדרג לתכנית בסיסית

source: Good for family, friends and small events
es: Bueno para familiares, amigos y pequeños eventos.
he: טוב למשפחה, חברים ואירועים קטנים

source: Buy Basic Plan
es: Comprar plan básico
he: תוכנית בסיסית

source: Upgrade to Expert plan
es: Actualizar al plan Experto
he: שדרג לתכנית מומחה

source: Multi-players events, promotional events with various audiences
es: Eventos multijugador, eventos promocionales con varios públicos.
he: אירועי רב שחקנים, אירועי קידום מכירות עם קהלים שונים

source: Buy Expert Plan
es: Comprar plan experto
he: קנו תוכנית מומחה

source: Buy Expert plan
es: Comprar plan experto
he: קנו תוכנית מומחה

source: Change to Expert plan
es: Comprar plan experto
he: קנו תוכנית מומחה

source: Reset Password
es: Restablecer la contraseña
he: איפוס סיסמה

source: New Password
es: Nueva contraseña
he: סיסמה חדשה

source: Reset
es: Reiniciar
he: אתחול

source: Your profile was successfuly updated
es: Tu perfil se actualizó correctamente
he: הפרופיל שלך עודכן בהצלחה

source: Check your mail inbox to reset password
es: Revise la bandeja de entrada de su correo para restablecer la contraseña
he: בדוק את תיבת הדואר שלך כדי לאפס את הסיסמה

source: Something went wrong. Please try again later.
es: Algo salió mal. Por favor, inténtelo de nuevo más tarde.
he: משהו השתבש. בבקשה נסה שוב מאוחר יותר.

source: This email is not registered to us. Please register first
es: Este correo electrónico no está registrado para nosotros. Regístrese primero
he: דואל זה לא רשום אצלינו. אנא הירשם תחילה

source: Please do enter the email
es: Por favor ingrese el correo electrónico
he: אנא הכנס את הדואל

source: Three digit CVV code on the back of your card
es: Código CVV de tres dígitos en el reverso de su tarjeta
